# Assignment 2 -- SQL 2

Complete the problems in this notebook.
It does not matter whether you show the output of each code block.
Submit your resulting .ipynb file on Canvas.

* COMP 430:  Complete Problems 1a-d, 2a-f.
  (Your final score will be multiplied by 1.25 to be out of 100 points.)
* COMP 533:  Complete Problems 1a-d, 2a-g.

**Specify which course you are in, COMP 430 or 533:**

First, the standard preliminary steps.  For security, don't include your ricedb password.

In [1]:
%load_ext sql

In [2]:
%sql postgresql://ricedb:3816@localhost:5433/postgres

u'Connected: ricedb@postgres'

# Problem 1

We provide SQL code to create a table with some data.  You will write SQL queries having the desired output.  In this problem, the behavior is described by example.

In [3]:
%%sql
DROP TABLE IF EXISTS Purchase;


CREATE TABLE Purchase (
    customer INT,                 -- ID of purchasing customer 
    item     INT,                 -- ID of purchased item 
    price    MONEY,               -- price of each purchased item
    quantity INT,                 -- quantity of items purchased
    PRIMARY KEY (customer, item)
);


INSERT INTO Purchase VALUES 
    (12567, 654,  7.00,  1),
    (15443, 423,  5.00, 23),
    (15443, 654,  6.50,  8),
    (28244, 766, 10.00,  1),
    (75245, 423,  5.50,  2);

Done.
Done.
5 rows affected.

[]

## Part a (5 points)

Write a SQL query that generates the following results from the data.

| total_quantity |
|:---------------|
|             35 |

In [4]:
%%sql
SELECT SUM(quantity ) AS total_quantity
FROM Purchase

1 rows affected.

[(35L,)]

## Part b (5 points)

Write a SQL query that generates the following results from the data.  The order of the rows is irrelevant.

| customer | item |  price  | quantity  | total_price  |
|:---------|:-----|:--------|:----------|:-------------|
| 12567    | 654  | \$7.00  | 1         | \$7.00       |
| 15443    | 423  | \$5.00  | 23        | \$115.00     |
| 15443    | 654  | \$6.50  | 8         | \$52.00      |
| 28244    | 766  | \$10.00 | 1         | \$10.00      |
| 75245    | 423  | \$5.50  | 2         | \$11.00      |

In [5]:
%%sql
SELECT customer, item,price,quantity,price*quantity as total_price
FROM Purchase

5 rows affected.

[(12567, 654, '$7.00', 1, '$7.00'),
 (15443, 423, '$5.00', 23, '$115.00'),
 (15443, 654, '$6.50', 8, '$52.00'),
 (28244, 766, '$10.00', 1, '$10.00'),
 (75245, 423, '$5.50', 2, '$11.00')]

## Part c (5 points)

Write a SQL query that generates the following results from the data.  The order of the rows is irrelevant.

| item | total_quantity |
|:-----|:---------------|
| 654  | 9              |
| 423  | 25             |
| 766  | 1              |

In [6]:
%%sql
SELECT item, sum(quantity) AS total_quantity
FROM Purchase
group by item

3 rows affected.

[(766, 1L), (423, 25L), (654, 9L)]

## Part d (5 points)

Write a SQL query that generates the following results from the data.  The order of the rows is irrelevant.

| customer | total_price |
|:---------|:------------|
|    12567 |      \$7.00 |
|    15443 |    \$167.00 |
|    28244 |     \$10.00 |
|    75245 |     \$11.00 |

In [7]:
%%sql
SELECT customer, price*quantity as total_price
FROM Purchase

5 rows affected.

[(12567, '$7.00'),
 (15443, '$115.00'),
 (15443, '$52.00'),
 (28244, '$10.00'),
 (75245, '$11.00')]

# Problem 2

For this problem, we'll give you the following schemas and data.
We are modeling a climbing club, where groups of members go together on climbs to various mountain peaks.

Schemas:
* Peak (<u>name</u>, elevation, difficulty, region)
  Difficulty is on a scale of 1 to 5.
* Climber (<u>name</u>, gender)
* Participate (<u>trip_id</u>, <u>climber_name</u>)
  Describes who participated in each climbing trip.
  Assume we only keep track of those who finish a climb.
* Climb (<u>trip_id</u>, peak_name, date) --
  We will assume that a climbing trip exists only if at
  least one person participated in it.
  While there is a way to enforce such a constraint, we haven't seen that yet.
      
In each part, if you use `CREATE VIEW`, then start your answer with the corresponding `DROP VIEW IF EXISTS`.  Here, when creating the tables, we use `DROP TABLE ... CASCADE` so that any dependent views are also dropped.

In [8]:
%%sql
DROP TABLE IF EXISTS Participate CASCADE;
DROP TABLE IF EXISTS Climb CASCADE;
DROP TABLE IF EXISTS Climber CASCADE;
DROP TABLE IF EXISTS Peak CASCADE;

CREATE TABLE Peak (
    name varchar(50),
    elevation INT,
    difficulty INT,
    region varchar(50),
    PRIMARY KEY (name)
);

CREATE TABLE Climber (
    name varchar(50),
    gender char(1),
    PRIMARY KEY (name)
);

CREATE TABLE Climb (
    trip_id INT,
    peak_name varchar(50),
    date DATE,
    PRIMARY KEY (trip_id)
);

CREATE TABLE Participate (
    trip_id INT,
    climber_name varchar(50),
    PRIMARY KEY (trip_id, climber_name),
    FOREIGN KEY (climber_name) REFERENCES Climber (name),
    FOREIGN KEY (trip_id) REFERENCES Climb (trip_id)
);

INSERT INTO Peak VALUES
    ('Everest', 29029, 5, 'Himalayas'),
    ('Mount Ranier', 14409, 4, 'Rocky Mountains'),
    ('Pikes Peak', 14114, 3, 'Rocky Mountains'),
    ('K2', 28251, 5, 'Himalayas'),
    ('Kilimanjaro', 19341, 4, 'Eastern Rift'),
    ('Corcoran', 13760, 2, 'Corcoran to Whitney'),
    ('Whitney', 14505, 3, 'Corcoran to Whitney'),
    ('Mallory', 13845, 2, 'Corcoran to Whitney'),
    ('Irvine', 13780, 2, 'Corcoran to Whitney');

INSERT INTO Climber VALUES
    ('Anna',  'F'),
    ('Beth',  'F'),
    ('Chad',  'M'),
    ('David', 'M'),
    ('Ellen', 'F'),
    ('Frank', 'M');

INSERT INTO Climb VALUES
    (1, 'Everest', '2015-01-01'),
    (2, 'Mount Ranier', '2016-01-16'),
    (3, 'Pikes Peak', '2016-01-30'),
    (4, 'Everest', '2016-02-04'),
    (5, 'Pikes Peak', '2015-01-02'),
    (6, 'K2', '2015-04-04'),
    (7, 'Whitney', '2016-01-12');

INSERT INTO Participate VALUES
    (1, 'Beth'),
    (1, 'Ellen'),
    (1, 'David'),
    (2, 'Beth'),
    (2, 'Ellen'),
    (3, 'Anna'),
    (3, 'Chad'),
    (3, 'David'),
    (3, 'Frank'),
    (5, 'Anna'),
    (6, 'Anna'),
    (7, 'Anna'),
    (7, 'Chad');

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
9 rows affected.
6 rows affected.
7 rows affected.
13 rows affected.

[]

## Part a (5 points)

Compute the elevation range for each region. This is computed as (highest peak height - lowest peak height + 1) for the region.

In [9]:
%%sql

SELECT max(elevation)-min(elevation)+1 As range,region
FROM Peak
group by region

4 rows affected.

[(1, u'Eastern Rift'),
 (746, u'Corcoran to Whitney'),
 (296, u'Rocky Mountains'),
 (779, u'Himalayas')]

## Part b (10 points)

What peak has been climbed in the most climbing trips?  If there is a tie, the result should have all those peaks that tie.

In [93]:
%%sql
DROP VIEW IF EXISTS ClimbTimes;
CREATE VIEW ClimbTimes AS
SELECT peak_name, Count(*) AS times
FROM Climb
GROUP BY peak_name;

SELECT peak_name, times 
FROM ClimbTimes 
WHERE times = (SELECT Max(times) 
               FROM ClimbTimes
              );

Done.
Done.
2 rows affected.

[(u'Pikes Peak', 2L), (u'Everest', 2L)]

## Part c (10 points)

Compute the total elevation gained by all of the men, and the total elevation gained by all of the women.  The "total elevation gained" is the sum of all of the heights of all peaks climbed.  The elevation of each peak climbed is included for each of its climbers.

In [116]:
%%sql 
SELECT sum(elevation),gender
FROM(

select * 
from climber
INNER JOIN Participate on Participate.climber_name = Climber.name
INNER JOIN Climb on Participate.trip_id=Climb.trip_id
INNER JOIN Peak on Peak.name=Climb.peak_name
) AS NEW
group by gender

2 rows affected.

[(157860L, u'F'), (85876L, u'M')]

## Part d (5 points)

Which peaks were climbed only by one climbing trip?

In [103]:

%%sql
DROP VIEW IF EXISTS timer;
CREATE VIEW timer AS
SELECT peak_name, COUNT(*) AS times
FROM Climb
GROUP BY peak_name;

SELECT peak_name, times 
FROM timer 
WHERE times = 1;

Done.
Done.
3 rows affected.

[(u'Mount Ranier', 1L), (u'K2', 1L), (u'Whitney', 1L)]

## Part e (15 points)

Who climbed their first peak before 'Anna' climbed her first peak?

In [102]:

%%sql
DROP VIEW IF EXISTS timer;
CREATE VIEW timer AS
SELECT Participate.climber_name, date
FROM Participate
INNER JOIN Climb ON Climb.trip_id = Participate.trip_id;

SELECT DISTINCT climber_name
FROM timer
WHERE date < (SELECT Min(date)
                    FROM timer
                    WHERE climber_name = 'Anna');

Done.
Done.
3 rows affected.

[(u'Ellen',), (u'Beth',), (u'David',)]

## Part f (15 points)

List all of the (climber, difficulty) pairs, such that the climber has climbed every peak of that difficulty.    Difficiulty values that don't actually occur should not appear in the output.

In [101]:
%%sql
DROP VIEW IF EXISTS diff;

CREATE VIEW diff AS 
SELECT Participate.climber_name, P.difficulty, Count(DISTINCT Climb.peak_name) AS count
FROM Participate INNER JOIN Climb ON Participate.trip_id = Climb.trip_id
INNER JOIN Peak AS P ON P.name = Climb.peak_name
WHERE (Climb.peak_name,P.difficulty) IN (SELECT Peak.name, Peak.difficulty 
                                          FROM Peak)
GROUP BY Participate.climber_name, P.difficulty;

SELECT climber_name, difficulty
FROM diff
WHERE count = (SELECT Count(*) 
               FROM Peak 
               WHERE diff.difficulty = Peak.difficulty);

Done.
Done.
2 rows affected.

[(u'Anna', 3), (u'Chad', 3)]

## Part g (COMP 533 only) (20 points)

What 1000-foot range of peak heights having at least 3 peaks has the greatest average difficulty?  Consider only those 1000-foot ranges where there is a peak at the lower end of the range.  For example, 'Spanish Needle' is 7841 feet high, so 7841 to 8840 is one 1000-foot range.  The results should have two columns: the low and high ends of each satisfying elevation range.

Hint:  At least our solution uses a join condition that isn't an equality.